app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.all
---
SELECT * FROM "contacts"

  def show
    @contacts = Contact.find(params[:id])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)

  def edit
    @contacts = Contact.find(params[:id])
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)

  def create
    @contacts = Contact.new(params[:contact])

    respond_to do |format|
      if @contacts.save
---
INSERT INTO "contacts" ("name", "updated_at", "home_number", "email", "created_at") VALUES(NULL, '2009-05-20 09:44:57', NULL, NULL, '2009-05-20 09:44:57')

  def destroy
    @contacts = Contact.find(params[:id])
    @contacts.destroy
---
SELECT * FROM "contacts" WHERE ("contacts"."id" = 1)
DELETE FROM "contacts" WHERE "id" = 1